# PANDAS

Built on top of Numpy used for fast analysis, data cleaning and preparation. pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.


What problem does pandas solve?

Python has long been great for data munging and preparation, but less so for data analysis and modeling. pandas helps fill this gap, enabling you to carry out your entire data analysis workflow in Python without having to switch to a more domain specific language like R.

Combined with the excellent IPython toolkit and other libraries, the environment for doing data analysis in Python excels in performance, productivity, and the ability to collaborate.

pandas does not implement significant modeling functionality outside of linear and panel regression; for this, look to statsmodels and scikit-learn. More work is still needed to make Python a first class statistical modeling environment, but we are well on our way toward that goal.

Documentation : https://pandas.pydata.org/pandas-docs/stable/

Pandas Cheat Sheet avalable here: https://www.datacamp.com/community/blog/python-pandas-cheat-sheet

pandas consists of the following elements:

--> A set of labeled array data structures, the primary of which are Series and DataFrame
--> Index objects enabling both simple axis indexing and multi-level / hierarchical axis indexing
--> An integrated group by engine for aggregating and transforming data sets
--> Date range generation (date_range) and custom date offsets enabling the implementation of customized frequencies
--> Input/Output tools: loading tabular data from flat files (CSV, delimited, Excel 2003), and saving and loading pandas objects from the fast and efficient PyTables/HDF5 format.
--> Memory-efficient “sparse” versions of the standard data structures for storing data that is mostly missing or mostly constant (some fixed value)
--> Moving window statistics (rolling mean, rolling standard deviation, etc.)

In [1]:
import pandas as pd

# Pandas Series

In [2]:
my_list = [10,20,30]

In [4]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

There is a provision for assigning index

In [5]:
ind = ['a', 'b', 'c']
pd.Series(data=my_list, index=ind)

a    10
b    20
c    30
dtype: int64

In [6]:
#If we specify dictionary, it will automatically take index vale
d = {'a':1 , 'b':2}

In [7]:
pd.Series(d)

a    1
b    2
dtype: int64

In [15]:
tab1 = pd.Series([1,2,3,4], ['A','B','C','D'])

In [16]:
#To access value use index which in case is 'A' here
tab1['A']

1

In [17]:
#Addition
tab2 = pd.Series([2,4,5,6], ['A','E','C','F'])

In [18]:
#Add only matching indexes
tab1 + tab2

A    3.0
B    NaN
C    8.0
D    NaN
E    NaN
F    NaN
dtype: float64

# DataFrame

In [21]:
from numpy.random import randn
import numpy as np

In [22]:
#set random seed to get same set of random number
np.random.seed(101)

In [23]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Each column and rows are pandas series sharing index

In [25]:
#To access W column
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [26]:
type(df['W'])

pandas.core.series.Series

In [27]:
#To get list of columns
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

# Create column

In [28]:
#To create new column
df['new'] = df['W'] + df['Y']

In [29]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

# To drop a column

In [31]:
#To drop a column. For drop method, axis = 0 is the index, whereas for columns axis = 1
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
#Drop did not affect the original frame
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [34]:
#For drop to take effect 'inplace' is used
df.drop('new', axis=1, inplace=True)

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
#To drop row
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

# Shape of dataframe

In [39]:
df.shape

(5, 4)

# Access rows of a dataframe

In [40]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [41]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

# Access a value in dataframe

In [42]:
df.loc['B', 'W']

0.6511179479432686

In [44]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [47]:
df.iloc[1,0]

0.6511179479432686

# Boolean

In [49]:
b_df = df > 0

In [50]:
b_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [52]:
#Values which are true are only returned
df[b_df]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
#Get boolean series where ['W'] > 0 , then returns 'x' of that boolean series
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [56]:
#To concatenate conditions use '&' not 'and' as they work with series not individual values
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

# Reset Index

In [57]:
#Index reset to column. To replace permanenty use 'inplace'
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

# Set Index

In [58]:
new_ind = 'S0 S1 S2 S3 S4'.split()

In [59]:
df['new_col'] = new_ind

In [60]:
df

          W         X         Y         Z new_col
A  2.706850  0.628133  0.907969  0.503826      S0
B  0.651118 -0.319318 -0.848077  0.605965      S1
C -2.018168  0.740122  0.528813 -0.589001      S2
D  0.188695 -0.758872 -0.933237  0.955057      S3
E  0.190794  1.978757  2.605967  0.683509      S4

In [63]:
#This is not 'inplace'
df.set_index('new_col')

                W         X         Y         Z
new_col
S0       2.706850  0.628133  0.907969  0.503826
S1       0.651118 -0.319318 -0.848077  0.605965
S2      -2.018168  0.740122  0.528813 -0.589001
S3       0.188695 -0.758872 -0.933237  0.955057
S4       0.190794  1.978757  2.605967  0.683509

In [62]:
df

          W         X         Y         Z new_col
A  2.706850  0.628133  0.907969  0.503826      S0
B  0.651118 -0.319318 -0.848077  0.605965      S1
C -2.018168  0.740122  0.528813 -0.589001      S2
D  0.188695 -0.758872 -0.933237  0.955057      S3
E  0.190794  1.978757  2.605967  0.683509      S4

# MultiIndex

In [64]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2' ]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
#
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [65]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [66]:
inside

[1, 2, 3, 1, 2, 3]

In [69]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [70]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [73]:
#call from outside index and go deeper
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [74]:
df.index.names = ['Groups', 'Num']

In [75]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [78]:
df.loc['G2'].loc[2]['B']

0.072959675317038689

In [80]:
#Cross section
df.xs(1, level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [81]:
d = {'A': [1,2,np.nan], 'B': [5,np.nan,np.nan], 'C': [1,2,3]}

In [82]:
df = pd.DataFrame(d)

In [83]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# Drop rows with null values

In [84]:
df.dropna()

     A    B  C
0  1.0  5.0  1

# Drop columns with null values

In [85]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

# Drop rows with null values adding threshold

In [87]:
#Row 3 had two NaN and will be dropped
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

# Fill missing values

In [88]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [90]:
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

# GroupBy

In [93]:
data = {'R1': ['A1', 'A1', 'B1', 'B1', 'C1', 'C1'],
        'R2': ['A', 'B', 'C', 'D', 'E', 'F'],
        'R3': [100,200,300,400,500,100] }

In [94]:
df =  pd.DataFrame(data)

In [95]:
df

   R1 R2   R3
0  A1  A  100
1  A1  B  200
2  B1  C  300
3  B1  D  400
4  C1  E  500
5  C1  F  100

In [96]:
df_g = df.groupby('R1').mean()

In [97]:
df_g

     R3
R1
A1  150
B1  350
C1  300

In [99]:
df_g = df.groupby('R1').sum()
df_g

     R3
R1
A1  300
B1  700
C1  600

In [100]:
df_g = df.groupby('R1').std()
df_g

            R3
R1
A1   70.710678
B1   70.710678
C1  282.842712

In [107]:
df.groupby('R1').describe()

      R3
   count   mean         std    min    25%    50%    75%    max
R1
A1   2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0
B1   2.0  350.0   70.710678  300.0  325.0  350.0  375.0  400.0
C1   2.0  300.0  282.842712  100.0  200.0  300.0  400.0  500.0

# Concatenation

In [108]:
data_1 = {'R1': ['A1', 'A1', 'B1', 'B1', 'C1', 'C1'],
        'R2': ['A', 'B', 'C', 'D', 'E', 'F'],
        'R3': [100,200,300,400,500,100] }

In [109]:
data_2 = {'R1': ['A1', 'A1', 'B1', 'B1', 'C1', 'C1'],
        'R2': ['A', 'B', 'C', 'D', 'E', 'F'],
        'R3': [100,200,300,400,500,100] }

In [110]:
df1 =  pd.DataFrame(data_1)
df2 =  pd.DataFrame(data_2)

In [115]:
pd.concat([df1,df2])

   R1 R2   R3
0  A1  A  100
1  A1  B  200
2  B1  C  300
3  B1  D  400
4  C1  E  500
5  C1  F  100
0  A1  A  100
1  A1  B  200
2  B1  C  300
3  B1  D  400
4  C1  E  500
5  C1  F  100

In [114]:
#Column concatenation
pd.concat([df1,df2], axis=1)

   R1 R2   R3  R1 R2   R3
0  A1  A  100  A1  A  100
1  A1  B  200  A1  B  200
2  B1  C  300  B1  C  300
3  B1  D  400  B1  D  400
4  C1  E  500  C1  E  500
5  C1  F  100  C1  F  100

# Merge

In [118]:
pd.merge(df1, df2, how='inner', on='R1')

    R1 R2_x  R3_x R2_y  R3_y
0   A1    A   100    A   100
1   A1    A   100    B   200
2   A1    B   200    A   100
3   A1    B   200    B   200
4   B1    C   300    C   300
5   B1    C   300    D   400
6   B1    D   400    C   300
7   B1    D   400    D   400
8   C1    E   500    E   500
9   C1    E   500    F   100
10  C1    F   100    E   500
11  C1    F   100    F   100

# Join

In [127]:
data_1 = pd.DataFrame({'R1': ['A1', 'A2', 'A3'],
        'R2': ['A', 'B', 'C']},
        index = ['K0','K1','K2'])

In [128]:
data_2 = pd.DataFrame({'R3': ['B1', 'B2', 'B3'],
        'R4': ['D', 'E', 'F']},
        index = ['K0','K1','K3'])

In [129]:
data_1.join(data_2)

    R1 R2   R3   R4
K0  A1  A   B1    D
K1  A2  B   B2    E
K2  A3  C  NaN  NaN

# UNIQUE

In [134]:
data_1 = pd.DataFrame({'R1': ['A1', 'A2', 'A3', 'A1'],
        'R2': ['A', 'B', 'C', 'D']},
        index = ['K0','K1','K2', 'K3'])

In [135]:
#array of unique values
data_1['R1'].unique()

array(['A1', 'A2', 'A3'], dtype=object)

In [136]:
#Number of unique values
data_1['R1'].nunique()

3

In [137]:
#Get how many times unique value occured in the column
data_1['R1'].value_counts()

A1    2
A3    1
A2    1
Name: R1, dtype: int64

# Apply

In [141]:
data_1 = pd.DataFrame({'R1': ['A1', 'A2', 'A3', 'A1'],
        'R2': [2,3,4,5]},
        index = ['K0','K1','K2', 'K3'])

In [142]:
data_1

    R1  R2
K0  A1   2
K1  A2   3
K2  A3   4
K3  A1   5

In [140]:
def sum(x):
    return x+2

In [143]:
data_1['R2'].apply(sum)

K0    4
K1    5
K2    6
K3    7
Name: R2, dtype: int64

In [144]:
data_1['R2'].apply(lambda x:x+2)

K0    4
K1    5
K2    6
K3    7
Name: R2, dtype: int64

# get column name

In [146]:
data_1.columns

Index(['R1', 'R2'], dtype='object')

In [147]:
data_1.index

Index(['K0', 'K1', 'K2', 'K3'], dtype='object')

# Sort

In [148]:
data_1.sort_values(by='R1')

    R1  R2
K0  A1   2
K3  A1   5
K1  A2   3
K2  A3   4